    Pandas, Python programlama dili için yüksek performanslı, kullanımı kolay veri yapıları ve veri analizi araçları sağlayan, açık kaynaklı, BSD lisanslı bir kütüphanedir.
    Proje ana sayfası: https://pandas.pydata.org/

In [2]:
import pandas as pd

# Pandas ile Veri Okuma

In [4]:
import os
os.getcwd()

'D:\\OneDrive\\egitim\\verilen\\BlueMarkAcademy\\Tarim_Kredi_Kooperatifleri_Merkez_Birligi\\preprocessing-analysis-ml-dl-big-data\\02_pandas'

In [3]:
df = pd.read_csv("D:/Datasets/Mall_Customers.csv", sep=",")

In [5]:
df.head(10)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

# Pandas Dataframe Şekli, Boyutu

In [6]:
df.shape

(200, 5)

In [1]:
# Yukarıdaki bilgiden 15 satır 6 sütundan oluştuğunu anlıyoruz.

# Dataframe hakkında daha detaylı bilgi

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
CustomerID                200 non-null int64
Gender                    200 non-null object
Age                       200 non-null int64
Annual Income (k$)        200 non-null int64
Spending Score (1-100)    200 non-null int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [10]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

# Okurken sütun seçmek, sep ve header

In [2]:
# sep="," niteliklerin birbirinden virgülile ayrılacaını söyler. Varsayılan virgüldür.
# Farklı bir ayraç için mutlaka bu parametre kullanılmalıdır.

In [8]:
df2 = pd.read_csv("D:/Datasets/Mall_Customers.csv",
                sep=",",
                header=0,
                usecols=["Gender","Age"])

In [9]:
df2.head()

   Gender  Age
0    Male   19
1    Male   21
2  Female   20
3  Female   23
4  Female   31

# Sütun İsimlerini Değiştirmek

In [26]:
new_col_names = ['SIRANO','ISIM','YAS','MESLEK','SEHIR','AYLIK_GELIR']
df.columns = new_col_names
df.head()

   SIRANO     ISIM  YAS       MESLEK     SEHIR  AYLIK_GELIR
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23  Pazarlamaci     Bursa         4800

# Sütunları Seçmek

In [12]:
df['AYLIK GELIR'].head()

0    3500
1    4200
2    9000
3    4200
4    4800
Name: AYLIK GELIR, dtype: int64

In [15]:
df.AYLIK_GELIR.head()

0    3500
1    4200
2    9000
3    4200
4    4800
Name: AYLIK_GELIR, dtype: int64

#  Birden fazla sütunu seçmek (liste içinde seçmeyi unutmayın!!!)

In [26]:
df[['ISIM','MESLEK']].head()

      ISIM       MESLEK
0    Cemal         Isci
1    Ceyda        Memur
2    Timur     Müzisyen
3    Burcu  Pazarlamaci
4  Yasemin  Pazarlamaci

# Yeni Sütun Eklemek

In [27]:
df['AYLIK_GELIR_DOLAR'] = df.AYLIK_GELIR / 5.5

In [28]:
df.head()

   SIRANO     ISIM  YAS       MESLEK     SEHIR  AYLIK_GELIR  AYLIK_GELIR_DOLAR
0       1    Cemal   35         Isci    Ankara         3500         636.363636
1       2    Ceyda   42        Memur   Kayseri         4200         763.636364
2       3    Timur   30     Müzisyen  Istanbul         9000        1636.363636
3       4    Burcu   29  Pazarlamaci    Ankara         4200         763.636364
4       5  Yasemin   23  Pazarlamaci     Bursa         4800         872.727273

In [29]:
df.shape

(17, 7)

In [30]:
df['medeni_hal'] = ['B','E','E','E','E','B','E','B','E','B','E','E','E','E','E','B','E']

In [31]:
df.head()

,SIRANO,ISIM,YAS,MESLEK,SEHIR,AYLIK_GELIR,AYLIK_GELIR_DOLAR,medeni_hal
0,1,Cemal,35,Isci,Ankara,3500,636.363636,B
1,2,Ceyda,42,Memur,Kayseri,4200,763.636364,E
2,3,Timur,30,Müzisyen,Istanbul,9000,1636.363636,E
3,4,Burcu,29,Pazarlamaci,Ankara,4200,763.636364,E
4,5,Yasemin,23,Pazarlamaci,Bursa,4800,872.727273,E

# Sütunları Birleştirmek

In [32]:
df['MESLEK_SEHİR'] = df['MESLEK'] + ' - ' + df['SEHIR']

In [33]:
df.head()

,SIRANO,ISIM,YAS,MESLEK,SEHIR,AYLIK_GELIR,AYLIK_GELIR_DOLAR,medeni_hal,MESLEK_SEHİR
0,1,Cemal,35,Isci,Ankara,3500,636.363636,B,Isci - Ankara
1,2,Ceyda,42,Memur,Kayseri,4200,763.636364,E,Memur - Kayseri
2,3,Timur,30,Müzisyen,Istanbul,9000,1636.363636,E,Müzisyen - Istanbul
3,4,Burcu,29,Pazarlamaci,Ankara,4200,763.636364,E,Pazarlamaci - Ankara
4,5,Yasemin,23,Pazarlamaci,Bursa,4800,872.727273,E,Pazarlamaci - Bursa

In [34]:
df['TL_DOLAR'] = df['AYLIK_GELIR'].astype(str) + ' - ' + df['AYLIK_GELIR_DOLAR'].astype(str)

In [35]:
df.head()

,SIRANO,ISIM,YAS,MESLEK,SEHIR,AYLIK_GELIR,AYLIK_GELIR_DOLAR,medeni_hal,MESLEK_SEHİR,TL_DOLAR
0,1,Cemal,35,Isci,Ankara,3500,636.363636,B,Isci - Ankara,3500 - 636.3636363636364
1,2,Ceyda,42,Memur,Kayseri,4200,763.636364,E,Memur - Kayseri,4200 - 763.6363636363636
2,3,Timur,30,Müzisyen,Istanbul,9000,1636.363636,E,Müzisyen - Istanbul,9000 - 1636.3636363636363
3,4,Burcu,29,Pazarlamaci,Ankara,4200,763.636364,E,Pazarlamaci - Ankara,4200 - 763.6363636363636
4,5,Yasemin,23,Pazarlamaci,Bursa,4800,872.727273,E,Pazarlamaci - Bursa,4800 - 872.7272727272727

# Her satır için benzersiz bir id oluşturmak

In [36]:
# Kaç satır var?
df.count()

SIRANO               17
ISIM                 17
YAS                  17
MESLEK               17
SEHIR                17
AYLIK_GELIR          17
AYLIK_GELIR_DOLAR    17
medeni_hal           17
MESLEK_SEHİR         17
TL_DOLAR             17
dtype: int64

In [40]:
df['ID'] = range(0,17)
df.head()

,SIRANO,ISIM,YAS,MESLEK,SEHIR,AYLIK_GELIR,AYLIK_GELIR_DOLAR,medeni_hal,MESLEK_SEHİR,TL_DOLAR,ID
0,1,Cemal,35,Isci,Ankara,3500,636.363636,B,Isci - Ankara,3500 - 636.3636363636364,0
1,2,Ceyda,42,Memur,Kayseri,4200,763.636364,E,Memur - Kayseri,4200 - 763.6363636363636,1
2,3,Timur,30,Müzisyen,Istanbul,9000,1636.363636,E,Müzisyen - Istanbul,9000 - 1636.3636363636363,2
3,4,Burcu,29,Pazarlamaci,Ankara,4200,763.636364,E,Pazarlamaci - Ankara,4200 - 763.6363636363636,3
4,5,Yasemin,23,Pazarlamaci,Bursa,4800,872.727273,E,Pazarlamaci - Bursa,4800 - 872.7272727272727,4

# Sütunları Yeniden Adlandırmak

In [42]:
sutun_degisimi = {'ID':'ROWID'}
df.rename(columns=sutun_degisimi, inplace=True)

In [44]:
df.head()

,SIRANO,ISIM,YAS,MESLEK,SEHIR,AYLIK_GELIR,AYLIK_GELIR_DOLAR,medeni_hal,MESLEK_SEHİR,TL_DOLAR,ROWID
0,1,Cemal,35,Isci,Ankara,3500,636.363636,B,Isci - Ankara,3500 - 636.3636363636364,0
1,2,Ceyda,42,Memur,Kayseri,4200,763.636364,E,Memur - Kayseri,4200 - 763.6363636363636,1
2,3,Timur,30,Müzisyen,Istanbul,9000,1636.363636,E,Müzisyen - Istanbul,9000 - 1636.3636363636363,2
3,4,Burcu,29,Pazarlamaci,Ankara,4200,763.636364,E,Pazarlamaci - Ankara,4200 - 763.6363636363636,3
4,5,Yasemin,23,Pazarlamaci,Bursa,4800,872.727273,E,Pazarlamaci - Bursa,4800 - 872.7272727272727,4

# Sütunların Sırasını Değiştirmek

In [37]:
# Yeni sıraya göre dataframe'i takrar kendine atayalım

In [45]:
df = df[['ROWID','SIRANO','ISIM','YAS','MESLEK','SEHIR','AYLIK_GELIR','AYLIK_GELIR_DOLAR','MESLEK_SEHİR']]

In [46]:
df.head()

,ROWID,SIRANO,ISIM,YAS,MESLEK,SEHIR,AYLIK_GELIR,AYLIK_GELIR_DOLAR,MESLEK_SEHİR
0,0,1,Cemal,35,Isci,Ankara,3500,636.363636,Isci - Ankara
1,1,2,Ceyda,42,Memur,Kayseri,4200,763.636364,Memur - Kayseri
2,2,3,Timur,30,Müzisyen,Istanbul,9000,1636.363636,Müzisyen - Istanbul
3,3,4,Burcu,29,Pazarlamaci,Ankara,4200,763.636364,Pazarlamaci - Ankara
4,4,5,Yasemin,23,Pazarlamaci,Bursa,4800,872.727273,Pazarlamaci - Bursa